[
  {
    "index": 0,
    "topic": "Example",
    "cy": "\nRoedd Gwen yn ferch ifanc oedd yn byw mewn pentref bach ger y mynyddoedd. Bob bore, byddai hi’n cerdded i lawr y lôn gul i gasglu llaeth ffres o fferm y teulu. Roedd y bore yma’n arbennig oherwydd roedd y nefoedd yn las, a’r adar yn canu’n uchel. Wrth gerdded heibio’r afon, sylwodd Gwen ar rywbeth rhyfedd. Roedd goleuni gwyrdd yn dod o dan y dŵr. Aeth hi’n agosach a gweld bod carreg fawr gyda symbol arni’n disgleirio. Rhoddodd hi ei llaw ar y garreg a chlywodd lais meddal yn galw ei henw.",
    "en": "\nGwen was a young girl who lived in a small village near the mountains. Every morning, she would walk down the narrow lane to collect fresh milk from the family farm. This morning was special because the skies were blue, and the birds were singing loudly. As she walked past the river, Gwen noticed something strange. A green light was coming from under the water. She went closer and saw a large stone with a symbol on it, shining. She placed her hand on the stone and heard a soft voice calling her name.\n"
  },
  {
    "index": 1,
    "topic": "Introducing Yourself",
    "en": "Hello! My name is Sarah. I am 22 years old, and I come from Spain. I live in a small town near Madrid with my parents and younger brother. I am a student at the university, and I study English and history. I enjoy learning new languages because I want to travel and speak with people from other countries. I speak Spanish, English and a little French. I also work part-time at a bookshop. I like helping people find books. In my free time, I enjoy reading, walking in the park, and listening to music. I also enjoy meeting my friends for coffee. I am friendly, and I like talking to new people. My favorite color is blue, and I love animals, especially cats. That is a little about me. Nice to meet you!",
    "cy": "Helo! Fy enw i yw Sarah. Dw i'n 22 mlwydd oed, ac dwi'n dod o Sbaen. Dwi'n byw mewn tref fach ger Madrid gyda fy rhieni a fy mrawd bach. Rydw i'n fyfyrwraig yn y brifysgol, ac dwi'n astudio Saesneg a hanes. Dw i'n mwynhau dysgu ieithoedd newydd achos dwi eisiau teithio a siarad â phobl o wledydd eraill. Dw i'n siarad Sbaeneg, Saesneg a bach o Ffrangeg. Dw i hefyd yn gweithio'n rhan-amser mewn siop lyfrau. Dw i'n hoffi helpu pobl i ffeindio llyfrau. Yn fy amser hamdden, dw i'n hoffi darllen, cerdded yn y parc, a gwrando ar gerddoriaeth. Dw i hefyd yn mwynhau cwrdd â fy ffrindiau am goffi. Dw i'n gyfeillgar ac dwi'n hoffi siarad â phobl newydd. Fy hoff liw yw glas, ac dw i'n caru anifeiliaid, cathod yn bennaf. Dyna dipyn amdanaf i. Neis i gwrdd â chi!"
  },
  {
    "index": 2,
    "topic": "Family",
    "en": "I have a small but happy family. There are four people in my family: my mother, my father, my sister, and me. My mother is a teacher, and my father is a driver. My sister is younger than me. She is 14 years old, and I am 17. We live together in a flat in the city. We like spending time together. On weekends, we watch movies or go to the park. My grandmother lives in another town, and we visit her every month. She is very kind and makes delicious food. I love my family very much. We help each other, and we talk every day. My parents are very supportive and always help me with school work. My sister and I play games and do homework together. I am very happy to have a family that cares for me.",
    "cy": "Mae gen i deulu bach ond hapus. Mae 'na bedwar person yn fy nheulu: fy mam, fy nhad, fy chwaer, a fi. Mae fy mam yn athrawes, ac mae fy nhad yn yrrwr. Mae fy chwaer yn iau na fi. Mae hi'n 14 mlwydd oed, ac dw i'n 17. Dan ni'n byw gyda'n gilydd mewn fflat yn y ddinas. Dan ni'n hoffi treulio amser gyda'n gilydd. Ar y penwythnos, dan ni'n gwylio ffilmiau neu'n mynd i'r parc. Mae fy mam-gu yn byw mewn tref arall, ac dan ni'n ymweld â hi bob mis. Mae hi'n garedig iawn ac yn gwneud bwyd blasus. Dwi'n caru fy nheulu llawer. Dan ni'n helpu'n gilydd, ac yn siarad bob dydd. Mae fy rhieni yn gefnogol iawn a gwastad yn fy helpu i â gwaith ysgol. Rydw i a fy chwaer yn chwarae gemau ac yn gwneud gwaith cartref gyda'n gilydd. Rydw i'n hapus iawn i gael teulu sydd yn edrych ar fy ôl i."
  },
  {
    "index": 3,
    "topic": "Hobbies & Free Time",
    "en": "In my free time, I like doing many different things. My favorite hobby is playing football with my friends. We play at the park every Saturday. I also enjoy listening to music, especially pop music. I listen to music every day when I do my homework or relax. Sometimes, I read books or watch TV. I like funny shows and cartoons. On weekends, I go for a walk, ride my bike, or draw. I draw pictures of animals and people. I find drawing fun and creative. I don’t like feeling bored, so I always try to do something. Sometimes I help my parents at home or play with my little brother. Hobbies are fun and help me learn new things. I think everyone should have a hobby. They make life more interesting.",
    "cy": "Yn fy amser rhydd, dw i'n hoffi gwneud llawer o bethau gwahanol. Fy hoff hobi yw chwarae pêl-droed gyda fy ffrindiau. Dan ni'n chwarae yn y parc bob dydd Sadwrn. Rydw i'n mwynhau gwrando ar gerddoriaeth hefyd, yn enwedig cerddoriaeth pop. Dw i'n gwrando ar gerddoriaeth bob dydd pan dwi'n gwneud fy ngwaith cartref neu'n ymlacio. Weithiau, dw i'n darllen llyfrau neu'n gwylio teledu. Dw i'n hoffi rhaglenni doniol a chartŵns. Ar y penwythnos, dwi'n mynd am dro, neu'n reidio fy meic, neu'n darlunio. Dwi'n darlunio lluniau o anifeiliaid a phobl. Dwi'n ffeindio darlunio yn hwyl ac yn greadigol. Dwi ddim yn hoffi teimlo'n ddiflas, felly dwi wastad yn ceisio gwneud rhywbeth. Weithiau dwi'n helpu fy rhieni adref neu'n chwarae gyda fy mrawd bach. Mae hobïau'n hwyl ac yn fy helpu i ddysgu pethau newydd. Dwi'n meddwl dylai pawb gael hobi. Maen nhw'n gwneud bywyd yn fwy diddorol."
  },
  {
    "index": 4,
    "topic": "Daily Routine",
    "en": "My daily routine is simple. I wake up at 7:00 in the morning. Then, I brush my teeth and have a shower. After that, I eat breakfast. I usually have toast and tea. At 8 o'clock, I go to school. I have lessons from 8:30 to 3:00. I enjoy English and psychology, but not maths, and science. After school, I go home and do my homework. In the evening, I like to relax. Sometimes I watch TV or play computer games. At 7pm, I eat dinner with my family. We talk and laugh together. After dinner, I read a book or listen to music. I go to bed at 10:00. I like my routine because it helps me stay organized. On weekends, my routine is different. I sleep late and go out with my friends or family. I think having a routine is good for me.",
    "cy": "Mae fy nhrefn ddyddiol yn syml. Dwi'n codi am 7 yn y bore. Wedyn, dwi'n brwsio fy nannedd ac yn cael cawod. Ar ôl hynny, dw i'n bwyta brecwast. Dwi fel arfer yn cael tost a the. Am 8 o'r gloch, dwi'n mynd i'r ysgol. Mae gen i wersi o 8:30 i 3:00. Dwi'n hoffi Saesneg a seicoleg, ond nid mathemateg neu wyddoniaeth. Ar ôl yr ysgol, dw i'n mynd adref ac yn gwneud fy ngwaith cartref. Yn y noswaith, dwi'n hoffi ymlacio. Weithiau, dwi'n gwylio teledu neu'n chwarae gemau cyfrifiadur. Am 7 yr hwyr, dwi'n bwyta swper gyda fy nheulu. Dan ni'n siarad ac yn chwerthin gyda'n gilydd. Ar ôl swper, dwi'n darllen llyfr neu'n gwrando ar gerddoriaeth. Dwi'n mynd i'r gwely am 10 o'r glock. Dwi'n hoffi trefn fy nydd achos mae'n fy helpu i i aros yn drefnus. Ar y penwythnos, mae fy nhrefn yn wahanol. Dwi'n cysgu'n hwyr ac yn mynd mas gyda fy ffrindiau neu fy nheulu. Dwi'n meddwl bod cael trefn yn dda i mi."
  },
  {
    "index": 5,
    "topic": "Weather",
    "en": "The weather is different every day. Sometimes it is sunny, and sometimes it is rainy. In my country, summer is very hot. The sun shines, and the sky is blue. People wear light clothes and go to the beach or swimming pool. In winter, it is very cold. I wear a coat, gloves, and a scarf. Sometimes it snows, and everything looks white. I like snow because I can play in it. In spring, the weather is warm, and flowers start to grow. It is a nice time for walks. Autumn is cool and windy. The leaves on the trees turn red and yellow. I like autumn because it is not too hot or too cold, and I like to wear jumpers.",
    "cy": "Mae'r tywydd yn wahanol bob dydd. Weithiau mae'n heulog, ac weithiau mae'n glawio. Yn fy ngwlad i, mae'r haf yn boeth iawn. Mae'r haul yn disgleirio ac mae'r awyr yn las. Mae pobl yn gwisgo dillad ysgafn ac yn mynd i'r traeth neu'r pwll nofio. Yn y gaeaf, mae'n oer iawn. Dwi'n gwisgo cot, menig, a sgarff. Weithiau mae'n bwrw eira, ac mae popeth yn edrych yn wyn. Dwi'n hoffi'r eira achos dwi'n gallu chwarae ynddo. Yn y gwanwyn, mae'r tywydd yn dwym ac mae'r blodau'n dechrau tyfu. Mae'n amser da i fynd am dro. Mae'r hydref yn glaear ac yn wyntog. Mae'r dail ar y coed yn troi'n goch a melyn. Dwi'n hoffi'r hydref achos dydy hi ddim yn rhy poeth neu'n rhy oer, ac dwi'n hoffi gwisgo siwmperi."
  },
  {
    "index": 6,
    "topic": "Food & Drink",
    "en": "I love food and trying new things. My favorite food is pizza. I like it with cheese, tomato, and mushrooms. I also enjoy eating pasta, rice, and chicken. For breakfast, I usually eat cereal and drink tea or juice. At lunch, I eat something light,like a sandwich or salad. For dinner, I eat something hot, like soup or meat with vegetables.  I like fruit, especially apples, bananas, and grapes. I don’t like spicy food very much, but I will try a little. I also enjoy sweet things like cake and chocolate, but I don’t eat them every day. My favorite drink is orange juice. I drink water during the day to stay healthy. I sometimes help my mother cook at home. It is fun, and I learn a lot. Eating good food is important to stay healthy, and I try to eat a mix of everything.",
    "cy": "Dwi'n caru bwyd a thrio pethau newydd. Fy hoff fwyd yw pitsa. Dwi'n ei hoffi gyda chaws, tomato a madarch. Dwi hefyd yn mwynhau bwyta pasta, reis, a chyw iâr. I frecwast, dwi fel arfer yn bwyta grawnfwyd ac yn yfed te neu sudd. I ginio, dwi'n bwyta rhywbeth ysgafn, fel brechdan neu salad. I swper, dwi'n bwyta rhywbeth poeth, fel cawl neu gig gyda llysiau. Dwi'n hoffi ffrwythau, yn enwedig afalau, bananas, a grawnwin. Dwi ddim yn hoffi bwyd sbeislyd llawer, ond byddwn i'n trio tipyn. Dwi hefyd yn hoffi pethau melys fel cacen neu siocled, ond dwi ddim yn eu bwyta nhw bob dydd. Fy hoff ddiod yw sudd oren. Dwi'n yfed dŵr yn ystof y diwrnod i aros yn iach. Dwi weithiau yn helpu fy mam wrth goginio adref. Mae'n hwyl, ac dwi'n dysgu llawer. Mae bwyta bwyd da yn bwysig i aros yn iach, ac dwi'n trio bwyta cymysg o bopeth."
  },
  {
    "index": 7,
    "topic": "Colours",
    "en": "There are many colours in the world, and I like them all. My favourite colour is green because it reminds me of trees and nature. I also like blue because it looks like the sky and the sea. When I draw or paint pictures, I try to use as many colours as possible to add meaning to my art. Red can mean love, and blue can mean peace. If you mix them, you create purple. My room is painted white, but I want to add more colour with posters and pictures. Colours make life more interesting and beautiful.",
    "cy": "Mae llawer o liwiau yn y byd, ac dwi'n eu hoffi nhw i gyd. Fy hoff liw yw gwyrdd achos mae'n fy atgoffa i o goed a natur. Dwi hefyd yn hoffi glas achos mae'n edrych fel yr awyr a'r môr. Pan dwi'n darlunio neu'n paentio lluniau, dwi'n trio defnyddio cymaint o liwiau bosib i ychwanegu ystyr i fy nghelf. Mae coch yn gallu golygu cariad, ac mae glas yn gallu golygu heddwch. Os ydych chi'n eu cymysgu nhw, dych chi'n creu porffor. Mae fy ystafell wedi'i phaentio'n wyn, ond dwi eisiau adio mwy o liw gyda phosteri a lluniau. Mae lliwiau'n gwneud bywyd yn fwy diddorol a phrydferth."
  },
  {
    "index": 8,
    "topic": "Clothes",
    "en": "I wear different clothes depending on the weather and the day. In summer, I wear light clothes like T-shirts, shorts, and sandals because it is hot. In winter, I wear warm clothes like jackets, jumpers, and boots. When I go to school, I wear my school uniform. On weekends, I wear jeans and a hoodie. My favourite piece of clothing is my red jumper. It is soft and warm. I wear it when I feel cold. I also like wearing hats and scarves in winter. At night, I wear pyjamas because they're comfortable. When it rains, I wear a raincoat and take an umbrella with me. I like going shopping for clothes with my family. I love showing off my style with my clothes.",
    "cy": "Dwi'n gwisgo dillad gwahanol yn dibynnu ar y tywydd a'r diwrnod. Yn yr haf, dwi'n gwisgo dillad ysgafn fel crysau t, siorts, a sandalau achos mae'n boeth. Yn y gaeaf, dwi'n gwisgo dillad twym fel siacedi, siwmperi a bŵts. Pan dwi'n mynd i'r ysgol, dwi'n gysgo fy ngwisg ysgol. Ar y penwythnos dwi'n gwisgo jîns a hwdi. Fy hoff ddarn o ddillad yw fy siwmper coch. Mae'n feddal ac yn dwym. Dwi'n ei wisgo fe pan dwi'n teimlo'n oer. Dwi hefyd yn hoffi gwisgo hetiau a sgarffiau yn y gaeaf. Yn y nos, dwi'n gwisgo pyjamas achos maen nhw'n gyfforddus. Pan mae'n bwrw glaw, dwi'n gwisgo cot law ac yn cymryd ymbarél gyda fi. Dwi'n hoffi mynd siopa am ddilad gyda fy nheulu. Dwi'n caru dangos fy steil gyda fy nillad."
  },
  {
    "index": 9,
    "topic": "Numbers",
    "en": "Today, I had to catch a train at half-past-nine in the morning. I woke up at seven, ate breakfast, and left the house at quarter past eight. At the station, I bought a ticket. It cost £4.50 for a one-way journey. I had a £10 note, so I got £5.50 back. The journey took about 40 minutes. When I arrived in the city centre, I went to a café. I asked how much a sandwich and a drink cost. The man said, “£5 for the sandwich and £3.50 for the drink.” I said, “Okay, I’ll just take the sandwich.” I'm trying to be better at saving money.",
    "cy": "Heddiw, roedd rhaid i mi dal trên am hanner awr wedi naw yn y bore. Deffrais am saith o'r gloch, bwytais frecwast, a gadawais y tŷ am chwarter wedi wyth. Yn yr orsaf, prynais docyn. Costiodd  £4.50 am daith unffordd. Roedd gen i nodyn £10, felly ces i £5.50 yn ôl. Cymerodd y siwrnai tua 40 munud. Pan gyrhaeddais i ganol y ddinas, es i i gaffi. Gofynnais faint bod brechdan a diod yn costio. Dywedodd y dyn, “£5 am y brechdan a £3.50 am y diod.” Meddais i, “Iawn, wna i jyst cymryd y brechdan.” Dwi'n trio bod yn well yn arbed arian."
  },
  {
    "index": 10,
    "topic": "Places in Town",
    "en": "There are many places in my town. I live in a small town, but it has everything I need. There is a school, a supermarket, a park, and a library. I go to school every day during the week. After school, I sometimes go to the library to read or do homework. On weekends, I go to the park with my friends. We play football or just walk around. My family goes to the supermarket to buy food. There is also a post office, a bank, and a hospital in my town. Sometimes, we eat at a restaurant in the town centre. My favourite place is the bakery. I love the smell of fresh bread. The people in my town are friendly. I like living here because everything is close, and I feel safe. I know where everything is, and that makes life easy.",
    "cy": "Mae llawer o lefydd yn fy nhref i. Dwi'n byw mewn tref fach, ond mae yno popeth dwi'n ei angen. Mae yna ysgol, archfarchnad, parc, a llyfrgell. Dwi'n mynd i'r ysgol bob dydd yn ystod yr wythnos. Ar ôl yr ysgol, dwi weithiau yn mynd i'r llyfrgell i ddarllen neu wneud fy ngwaith cartref. Ar y penwythnos, dwi'n mynd i'r parc gyda fy ffrindiau. Dan ni'n chwarae pêl-droed neu'n cerdded o gwmpas. Mae fy nheulu'n mynd i'r archfarchnad i brynu bwyd. Mae yna hefyd swyddfa'r post, banc, ac ysbyty yn fy nhref. Weithiau dan ni'n bwyta ym mwyty yng nghanol y dref. Fy hoff le yw'r popty. Dwi'n caru'r arogl o fara ffres. Mae'r bobl yn fy nhref yn gyfeillgar. Dwi'n hoffi byw yma achos mae popeth yn agos ac dwi'n teimlo'n ddiogel. Dwi'n gwybod ble mae popeth, ac mae hynny'n gwneud bywyd yn hawdd."
  },
  {
    "index": 11,
    "topic": "Countries & Travel",
    "en": "I love learning about different countries. I live in Brazil, and it is a big and beautiful country. We have beaches, forests, and big cities. I want to travel to other countries in the future. I would like to visit the United States, Japan, and Italy. I want to see famous places, try new food, and meet new people. When you travel, you learn about different cultures and languages. It is exciting to see how people live in other places. I have never been on a plane, but I hope to travel one day. My cousin went to France, and she shared so many interesting stories with me and photos with me, it looks so beautiful there!",
    "cy": "Dwi'n caru dysgu am wledydd gwahanol. Dwi'n byw ym Mrasil, ac mae'n wlad fawr a hardd. Mae gennym ni traethau, coedwigoedd, a dinasoedd mawr. Dwi eisiau teithio i wledydd eraill yn y dyfodol. Hoffwn i ymweld â'r Unol Daleithau, Siapan a'r Eidal. Dwi eisiau gweld llefydd enwog, trio bwyd newydd, a chwrdd â phobl newydd. Mae'n gyffrous i weld sut mae pobl yn byw mewn llefydd gwahanol. Dwi erioed wedi bod ar awyren, ond dwi'n gobeithio teithio un diwrnodd. Aeth fy nghefnither i Ffrainc, a rhannodd cymaint o straeon diddorol a lluniau gyda fi, mae'n edrych mor brydferth yno!"
  }
]
